//TPK8CONTROL.h
//****************  分布式供暖系统热力站优化节能控制V2.0  ************
//&&&&&&&&&&&&&&&&&&&&&&&   TPK8CONTROL,V2.0  &&&&&&&&&&&&&&&&&&&&&&&&
//&&&&&&&&&&&&&&&&&&&&&&&    BAY YTQ,2015.1   &&&&&&&&&&&&&&&&&&&&&&&&
//只在文件中增加了"TPK8CONTROL.H"和"TPK8CONTROL.C"  ****************
//用"YY" 找到需要共同确定的地方！*************************************
//"TPK8CONTROL.H"   **************************************************
//注意:	1.计算控制输出为开关和频率数值,必须根据DA和接线换算后--AO和DO输出!
//int				//根据编译器定义的输出INT,也可以用CHR或者位变量
//	 	BPBONL,		//量调节变频泵,=0停止,=1启动!!!!!!!!!!!!!!!!!
//	 	BPBONZ;		//质调节变频泵,=0停止,=1启动!!!!!!!!!!!!!!!!!
//float
//		OUT_PLL,	//量调节输出频率(Hz)!!!!!!!!!!!!!!!!!!!!
//	    OUT_PLZ;	//质调节输出频率(Hz)!!!!!!!!!!!!!!!!!!!!!
//		2.必须根据操作系统建立任务,运行TPK8control(),周期为1-N分钟--N可设定
//		3.开机--各参数采样,必须运行TPK8control_init(),进行初始化
//		4.用于普通与分布式供热系统，基本控制工况如下表[*为推荐采用工况] 
//		5.由于多水泵并联使用,流量增加小,效率降低大,所以先不考虑多泵工况!
//_____________________________________________________________________________
//流量控制工况|LLKZGK=0不控|1控[差]压|2变频∝G#|3分挡控[差]压|4多泵1变频#测流量
//温度控制工况|WDKZGK=0不控|1定值控温|2变供水温|3分模糊值控温|流量小只用1水泵
//_____________________________________________________________________________
//LLKZGK=2的量调节适用于阻力不变的系统的热力站的优化节能控制,系统节电/节热高
//LLKZGK=2,量调节可用Set_LL=PLL*100/PLMAXL(%)表示相对流量,可不用流量传感器
//而 LLKZGK=1,3,4的量调，必须测流量。  LLKZGK=3,4暂时不用
//_____________________________________________________________________________
//控制工况设定      | 优化节能供暖集中控制          |分户调-站/入口控制方案
//流量控制工况LLKZGK|=0  |=1  |=2#*|                |=0  |=0 |=1  |=0* |=2*
//温度控制工况WDKZGK|=0  |=1  |=2#*|                |=0  |=1 |=1  |=2* |=1*
//          本站造价|最低|高  |低                   |最低|低 |高  |低  |低
//              节能|最低|低  |高                   |电高|高 |略低|高  |低
//_____________________________________________________________________________
// 
//tpk8**************************************************************************
#ifndef __TPK8CONTROL_H
#define __TPK8CONTROL_H

#include <math.h>

void autocontrol_lt2(void);	//量调-自动控制,用于阻力不变系统,用频率计算流量,无工频泵
void autocontrol_lt1(void);	//量调-自动控制,用于阻力变系统,无工频泵
void autocontrol_zt(void);			//自动控制--质调节
void PID(void);  
void comput_TWp(void);
void autocontrol(void);
extern void TPK8control_init(void);
extern void TPK8control(void);

#endif
//TPK8CONTRL.H END**********************************************************************
